Revit 2026 API

# FabricationAncillaryUsage Class

---

Structure that holds information about the usage of a fabrication ancillary

SystemObject Autodesk.Revit.DBFabricationAncillaryUsage

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationAncillaryUsage : IDisposable
```
```vb
Public Class FabricationAncillaryUsage
	Implements IDisposable
```
```cpp
public ref class FabricationAncillaryUsage : IDisposable
```
```fsharp
type FabricationAncillaryUsage =
    class
        interface IDisposable
    end
```

The FabricationAncillaryUsage type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AncillaryDepth | Depth of required ancillary if it isn't round. |
|  | AncillaryId | Fabrication ancillary database identifier. |
|  | AncillaryWidthOrDiameter | Width or diameter of required ancillary. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | Length of required ancillaries. |
|  | ProductCode | A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it. |
|  | Quantity | Quantity of required ancillaries. |
|  | Type | Fabrication ancillary type. |
|  | UsageType | Fabrication ancillary usage type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationAncillaryUsage |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace